#+title: emacs desktop environment
#+property: header-args:emacs-lisp :tangle ./desktop.el

** exwm configuration

we use the excellent [[https://github.com/ch11ng/exwm][exwm]] module as the basis for our emacs desktop environment.  the [[https://github.com/ch11ng/exwm/wiki][exwm wiki]] is a great place to find tips about how to configure everything!

*note:* make sure you've installed =nm-applet=, =pasystray= and =blueman= for the system tray apps to work!

#+begin_src emacs-lisp
  
      ;; (defun efs/run-in-background (command)
      ;;   (let ((command-parts (split-string command "[ ]+")))
      ;;     (apply #'call-process `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))
  
      (defun  efs/set-wallpaper ()
	(interactive)
	;; note: you will need to update this to a valid background path!
	(start-process-shell-command
	 "feh" nil  "feh --bg-scale ~/wpp/3354772.jpg"))
  
      ;; # (defun efs/exwm-init-hook ()
      ;; #     ;; make workspace 1 be the one where we land at startup
      ;; #     (exwm-workspace-switch-create 1)
  
      ;; #     ;; open eshell by default
      ;; #     ;;(eshell)
  
      ;; #     ;; NOTE: The next two are disabled because we now use Polybar!
  
      ;; #     ;; Show battery status in the mode line
      ;; #     ;;(display-battery-mode 1)
  
      ;; #     ;; Show the time and date in modeline
      ;; #     ;;(setq display-time-day-and-date t)
      ;; #     ;;(display-time-mode 1)
      ;; #     ;; Also take a look at display-time-format and format-time-string
  
      ;; #     ;; Start the Polybar panel
      ;; #     (efs/start-panel)
  
      ;; #     ;; Launch apps that will run in the background
      ;; #     (efs/run-in-background "dunst")
      ;; #     ;; (efs/run-in-background "nm-applet")
      ;; #     (efs/run-in-background "pasystray"i))
      ;; #     ;; (efs/run-in-background "blueman-applet"))
  
      ;; #   (defun efs/exwm-update-class ()
      ;; #     (exwm-workspace-rename-buffer exwm-class-name))
  
      ;; #   (defun efs/exwm-update-title ()
      ;; #     (pcase exwm-class-name
      ;; #       ("Firefox" (exwm-workspace-rename-buffer (format "Firefox: %s" exwm-title)))))
  
      ;; #   ;; This function isn't currently used, only serves as an example how to
      ;; #   ;; position a window
      ;; #   (defun efs/position-window ()
      ;; #     (let* ((pos (frame-position))
      ;; # 	   (pos-x (car pos))
      ;; # 	    (pos-y (cdr pos)))
  
      ;; #       (exwm-floating-move (- pos-x) (- pos-y))))
  
      ;; #   (defun efs/configure-window-by-class ()
      ;; #     (interactive)
      ;; #     (pcase exwm-class-name
      ;; #       ("Firefox" (exwm-workspace-move-window 2))
      ;; #       ("Sol" (exwm-workspace-move-window 3))
      ;; #       ("mpv" (exwm-floating-toggle-floating)
      ;; # 	     (exwm-layout-toggle-mode-line))))
  
      ;; #   ;; This function should be used only after configuring autorandr!
      ;; #   (defun efs/update-displays ()
      ;; #     (efs/run-in-background "autorandr --change --force")
      ;; #     (efs/set-wallpaper)
      ;; #     (message "Display config: %s"
      ;; # 	     (string-trim (shell-command-to-string "autorandr --current"))))
  
      ;; #   (use-package exwm
      ;; #     :config
      ;; #     ;; Set the default number of workspaces
      ;; #     (setq exwm-workspace-number 5)
  
      ;; #     ;; When window "class" updates, use it to set the buffer name
      ;; #     (add-hook 'exwm-update-class-hook #'efs/exwm-update-class)
  
      ;; #     ;; When window title updates, use it to set the buffer name
      ;; #     (add-hook 'exwm-update-title-hook #'efs/exwm-update-title)
  
      ;; #     ;; Configure windows as they're created
      ;; #     (add-hook 'exwm-manage-finish-hook #'efs/configure-window-by-class)
  
      ;; #     ;; When EXWM starts up, do some extra confifuration
      ;; #     (add-hook 'exwm-init-hook #'efs/exwm-init-hook)
  
      ;; #     ;; Rebind CapsLock to Ctrl
      ;; #     (start-process-shell-command "xmodmap" nil "xmodmap ~/.emacs.d/exwm/Xmodmap")
  
      ;; #     ;; NOTE: Uncomment the following two options if you want window buffers
      ;; #     ;;       to be available on all workspaces!
  
      ;; #     ;; Automatically move EXWM buffer to current workspace when selected
      ;; #     ;; (setq exwm-layout-show-all-buffers t)
  
      ;; #     ;; Display all EXWM buffers in every workspace buffer list
      ;; #     ;; (setq exwm-workspace-show-all-buffers t)
  
      ;; #     ;; NOTE: Uncomment this option if you want to detach the minibuffer!
      ;; #     ;; Detach the minibuffer (show it with exwm-workspace-toggle-minibuffer)
      ;; #     ;;(setq exwm-workspace-minibuffer-position 'top)
  
      ;; #     ;; Set the screen resolution (update this to be the correct resolution for your screen!)
      ;; #     (require 'exwm-randr)
      ;; #     (exwm-randr-enable)
      ;; #     (start-process-shell-command "xrandr" nil "xrandr --output Virtual-1 --primary --mode 2048x1152 --pos 0x0 --rotate normal")
  
      ;; #     ;; This will need to be updated to the name of a display!  You can find
      ;; #     ;; the names of your displays by looking at arandr or the output of xrandr
      ;; #     (setq exwm-randr-workspace-monitor-plist '(2 "Virtual-2" 3 "Virtual-2"))
  
      ;; #     ;; NOTE: Uncomment these lines after setting up autorandr!
      ;; #     ;; React to display connectivity changes, do initial display update
      ;; #     ;; (add-hook 'exwm-randr-screen-change-hook #'efs/update-displays)
      ;; #     ;; (efs/update-displays)
  
      ;; #     ;; Set the wallpaper after changing the resolution
	  (efs/set-wallpaper)
  
      ;; #     ;; NOTE: This is disabled because we now use Polybar!
      ;; #     ;; Load the system tray before exwm-init
      ;; #     ;; (require 'exwm-systemtray)
      ;; #     ;; (setq exwm-systemtray-height 32)
      ;; #     ;; (exwm-systemtray-enable)
  
  ;;     ;; Automatically send the mouse cursor to the selected workspace's display
  ;;     (setq exwm-workspace-warp-cursor t)
  
  ;;     ;; Window focus should follow the mouse pointer
  ;;     (setq mouse-autoselect-window t
  ;;           focus-follows-mouse t)
  
  ;;     ;; These keys should always pass through to Emacs
  ;;     (setq exwm-input-prefix-keys
  ;;           '(?\C-x
  ;;             ?\C-u
  ;;             ?\C-h
  ;;             ?\M-x
  ;;             ?\M-`
  ;;             ?\M-&
  ;;             ?\M-:
  ;;             ?\C-\M-j  Buffer list
  ;;             ?\C-\ )) ;; Ctrl+Space
  
  ;; Ctrl+Q will enable the next key to be sent directly
  ;; (define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)
  
  ;;     ;; Set up global key bindings.  These always work, no matter the input state!
  ;;     ;; Keep in mind that changing this list after EXWM initializes has no effect.
  (setq exwm-input-global-keys
	`(
	  ;;             Reset to line-mode (C-c C-k switches to char-mode via exwm-input-release-keyboard)
	  ([?\s-r] . exwm-reset)
  
	  ;;             Move between windows
	  ([s-left] . windmove-left)
	  ;; ([s-j] . windmove-left)
	  ([s-right] . windmove-right)
	  ;; ([s-left] . windmove-left)
	  ([?\s-k] . windmove-up)
	  ([s-up] . windmove-up)
	  ([?\s-j] . windmove-down)
	  ([s-down] . windmove-down)
  
  ;;             ;; Launch applications via shell command
	  ([?\s-&] . (lambda (command)
		       (interactive (list (read-shell-command "$ ")))
		       (start-process-shell-command command nil command)))
  
  ;;             ;; Switch workspace
	  ([?\s-w] . exwm-workspace-switch)
	  ([?\s-`] . (lambda () (interactive) (exwm-workspace-switch-create 0)))
  
  ;;             ;; 's-N': Switch to certain workspace with Super (Win) plus a number key (0 - 9)
	,@(mapcar (lambda (i)
		    `(,(kbd (format "s-%d" i)) .
		      (lambda ()
			(interactive)
			(exwm-workspace-switch-create ,i))))
		  (number-sequence 0 9))))
  
  ;; (exwm-input-set-key (kbd "s-SPC") 'counsel-linux-app)
  
  ;;     (exwm-enable))
  
#+end_src

#+RESULTS:
: (([8388722] . exwm-reset) ([s-left] . windmove-left) ([s-right] . windmove-right) ([8388715] . windmove-up) ([s-up] . windmove-up) ([8388714] . windmove-down) ([s-down] . windmove-down) ([8388646] lambda (command) (interactive (list (read-shell-command $ ))) (start-process-shell-command command nil command)) ([8388727] . exwm-workspace-switch) ([8388704] lambda nil (interactive) (exwm-workspace-switch-create 0)) ([8388656] lambda nil (interactive) (exwm-workspace-switch-create 0)) ([8388657] lambda nil (interactive) (exwm-workspace-switch-create 1)) ([8388658] lambda nil (interactive) (exwm-workspace-switch-create 2)) ([8388659] lambda nil (interactive) (exwm-workspace-switch-create 3)) ([8388660] lambda nil (interactive) (exwm-workspace-switch-create 4)) ([8388661] lambda nil (interactive) (exwm-workspace-switch-create 5)) ([8388662] lambda nil (interactive) (exwm-workspace-switch-create 6)) ([8388663] lambda nil (interactive) (exwm-workspace-switch-create 7)) ([8388664] lambda nil (interactive) (exwm-workspace-switch-create 8)) ([8388665] lambda nil (interactive) (exwm-workspace-switch-create 9)))

# #+RESULTS:
# : t

